-- phpMyAdmin SQL Dump
-- version 5.1.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Nov 24, 2021 at 07:46 PM
-- Server version: 10.4.21-MariaDB
-- PHP Version: 7.3.31

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `address-book`
--

-- --------------------------------------------------------

--
-- Table structure for table `location`
--

CREATE TABLE `location` (
  `ID` int(11) NOT NULL,
  `Village_Name` varchar(100) NOT NULL,
  `Taluka_Name` varchar(100) NOT NULL,
  `District_Name` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `location`
--

INSERT INTO `location` (`ID`, `Village_Name`, `Taluka_Name`, `District_Name`) VALUES
(2, 'ખીટલા ', '', ''),
(3, 'બોરીપીપડી', '', ''),
(4, 'બોટાદ', '', ''),
(5, 'લીંબાળા', '', ''),
(6, 'રાયપર', '', ''),
(9, 'ગ્રામભડી ', '', ''),
(10, 'ગુદીયાવડા', '', ''),
(11, 'નાના હણિયા', '', ''),
(12, 'રતડિયા', '', ''),
(13, 'રતનપર', '', ''),
(14, 'વિરવા', '', ''),
(15, 'સુદામડા', '', ''),
(16, 'નડાળા', '', ''),
(17, 'લિબાળા', '', ''),
(18, 'સેજકપર', '', ''),
(19, 'જસદણ', '', ''),
(20, 'ડોળિયા', '', ''),
(21, 'ધજાળા', '', ''),
(22, 'ધુરફણીયા', '', ''),
(23, 'લાખાવાડ', '', ''),
(24, 'વાટાવ્છ', '', ''),
(25, 'નાગડકા', '', ''),
(26, 'બરવાળા', '', ''),
(27, 'કુંભારા ', '', ''),
(28, 'વડીયા', '', ''),
(29, 'મોલડી', '', ''),
(30, 'જાનીવsલા', '', ''),
(31, 'સાંગોઈ', '', ''),
(32, 'મદારગઢ ', '', ''),
(33, 'રાજકોટ', '', ''),
(34, 'નોલી', '', ''),
(35, 'સાયલા', '', ''),
(36, '-', '', ''),
(37, 'કરાડી ', '', ''),
(38, 'તુરખા', '', '');

-- --------------------------------------------------------

--
-- Table structure for table `persons`
--

CREATE TABLE `persons` (
  `ID` int(11) NOT NULL,
  `Amount` varchar(50) NOT NULL,
  `First_Name` varchar(100) CHARACTER SET utf8mb4 NOT NULL,
  `Last_Name` varchar(100) CHARACTER SET utf8mb4 NOT NULL,
  `Surname` varchar(100) CHARACTER SET utf8mb4 NOT NULL,
  `Village_Name` varchar(100) CHARACTER SET utf8mb4 NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1 COMMENT='Persons';

--
-- Dumping data for table `persons`
--

INSERT INTO `persons` (`ID`, `Amount`, `First_Name`, `Last_Name`, `Surname`, `Village_Name`) VALUES
(15, '101', 'ભરતભાઈ', 'હરસુરભાઈ', 'ગોવાળીયા', '6'),
(16, '101', 'ભરતભાઈ', 'નાંગભાઈ', 'ગોવાળીયા', '6'),
(17, '101', 'ભગીરથભાઈ', 'વલકુભાઈ', 'ગોવાળીયા', '6'),
(18, '101', 'શાંતુભાઈ', 'ભુરાભાઇ', 'ગોવાળીયા', '5'),
(19, '101', 'બાબભાઇ', 'જેઠુરભાઈ', 'ઘાઘલ', '4'),
(20, '501', 'હરેશભાઇ', 'જોરૃભાઈ', 'ભાભળા', '4'),
(28, '101', 'કનુભાઈ', 'દાદભાઈ', 'કરપડા', '3'),
(34, '101', 'ભીખુભાઈ', 'અનકભાઈ', 'ખવડ', '9'),
(35, '101', 'સુરીગભાઈ', 'વિક્રમભાઈ', 'ખવડ', '9'),
(36, '101', 'મધુભાઈ', 'અમકુભાઈ', 'ગોવાળીયા', '6'),
(37, '101', 'મધુભાઈ', 'વાસભાઈ', 'ખવડ', '10'),
(38, '101', 'રણજીતભાઈ', 'ભૂપતભાઈ', 'ખવડ', '10'),
(39, '101', 'રવિભાઈ', 'મધુભાઈ', 'ખવડ', '11'),
(40, '101', 'વિજયરાજ સિહ', 'અણદૂભાઈ', 'જાડેજા', '12'),
(41, '101', 'ભાવેશભાઈ', 'ટપુભાઈ', 'ધાધલ', '13'),
(42, '101', 'જયદીપભાઈ', '-', 'વ્યાસ', '13 '),
(43, '101', 'જયદીપભાઈ', '-', 'ડાભી', '13'),
(44, '101', 'નિલેશભાઈ', '-', 'બાવળિયા', '13'),
(45, '101', 'બાબભાઈ', 'સાપાભાઈ', 'ખાચર', '14'),
(46, '101', 'ભરતભાઈ', 'જેઠુંરભાઈ', 'ખાચર', '6'),
(47, '151', 'આપભાઈ', 'તપુભાઈ', 'ખવડ', '15'),
(48, '101', 'રાજુભાઈ', 'ભીમભાઈ', 'ખવડ', '9'),
(49, '101', 'દડૂભાઈ', 'કાથડભાઈ', 'ગોવાળીયા', '6'),
(50, '101', 'શાંતુભાઈ', 'જીવાભાઈ', 'ગોવાળીયા', '6'),
(51, '101', 'કથુભાઈ', 'વીકૂભાઈ', 'ખાચર', '16'),
(52, '101', 'વલકુંભાઈ', 'કાળુભાઇ', 'ખવડ', '17'),
(53, '101', 'અનકૂભાઈ', 'જીલુભાઈ', 'ખવડ', '5'),
(54, '201', 'પ્રતાપભાઈ', 'દાદભાઈ', 'ખવડ', '10'),
(55, '151', 'ગભરુંભાઈ', 'ભૂપતભાઈ', 'ખવડ', '18'),
(56, '101', 'પ્રતાપભાઈ', 'જેઠુરભાઈ', 'ખાચર', '19'),
(57, '101', 'દનકુભાઈ', 'ટપુભાઈ', 'ખાચર', '20'),
(58, '101', 'નાજભાઈ', 'દેવાયતભાઈ', 'ખવડ', '21'),
(59, '101', 'ભરતભાઈ', 'નાજભાઈ', 'ગોવાળીયા', '22'),
(60, '101', 'શાંતુભાઈ', 'દેવાયતભાઈ', 'ખવડ', '23'),
(61, '101', 'પોલા', 'હામા', 'ત્રમટા', '2'),
(62, '101', 'ભૂપતભાઈ', 'નાજભાઈ', 'ખવડ', '24'),
(63, '101', 'રાજુભાઇ', 'ભાબભાઈ', 'ખવડ', '10'),
(64, '101', 'વહતુંભાઈ', 'ટપુભાઈ', 'ખવડ', '10'),
(65, '201', 'નાગભાઈ', 'ભોજભાઈ', 'કરપડા', '15'),
(66, '101', 'લઘુભાઈ', 'નનકાભાઈ', 'ખાચર', '25'),
(67, '101', 'જેઠુંરભાઈ', 'નનકાભાઈ', 'ખાચર', '25'),
(68, '101', 'રવુંભાઈ', 'શાંતુભાઈ', 'ખાચર', '26'),
(69, '101', 'કનુભાઈ', 'દાદભાઈ', '-', '24'),
(70, '101', 'ધીરુભાઈ', 'વીશુંભાઈ', 'ખાચર', '25'),
(71, '101', 'મનુભાઈ', 'નાંગભાઈ', 'ખાચર', '25'),
(72, '101', 'દીલુભાઈ', 'સુરીગભાઈ', 'ખવડ', '24'),
(73, '101', 'અનકૂભાઈ', 'નાજભાઈ', 'ખાચર', '27'),
(74, '101', 'લઘુભાઈ', 'સુરીગભાઈ', '-', '10'),
(75, '101', 'ભરતભાઈ', 'આપાભાઈ', 'ખવડ', '24'),
(76, '101', 'રવુંભાઈ', 'આપાભાઈ', 'ખવડ', '24'),
(77, '101', 'શાંતુભાઈ', 'રામભાઈ', 'ખવડ', '24'),
(78, '101', 'આલકૂભાઈ', 'પૂજભાઈ', 'ખવડ', '24'),
(79, '101', 'ભૂપતભાઈ', 'સાદુંળભાઈ', 'ખાચર', '24'),
(80, '101', 'અનકૂભાઈ', 'આપભાઈ', '-', '23'),
(81, '101', 'શાંતુભાઈ', 'આપભાઈ', '-', '23'),
(82, '101', 'ભાભલુભાઈ', 'ટપુભાઈ', 'કરપડા', '28'),
(83, '101', 'પ્રતાપભાઈ', 'ભીખુભાઈ', 'જળું', '29'),
(84, '101', 'જયરાજભાઈ', 'ગોદsભાઈ', 'જળું', '29'),
(85, '101', 'મંગલુંભાઈ', 'બાવકુંભાઈ', 'ગીડા', '29'),
(86, '101', 'રવિરાજભાઈ', 'કનુભાઈ', 'ખવડ', '29'),
(87, '101', 'રણજીતભાઈ', 'બાવકુંભાઈ', 'જળું', '29'),
(88, '101', 'યુવરાજભાઈ', 'વલકુંભાઈ', 'ખાચર', '29'),
(89, '101', 'જયદીપભાઈ', 'બાબભાઈ', 'ધાધલ', '29'),
(90, '101', 'નાગભાઈ', 'અનકભાઈ', 'જળું', '29'),
(91, '101', 'બાબભાઈ', 'પીઠુંભાઈ', 'ખાચર', '30'),
(92, '101', 'રવુંભાઈ', 'દાદભાઈ', 'ખાચર', '31'),
(93, '101', 'હાથીભાઈ', 'દેવાયતભાઈ', 'ડાંગર', '25'),
(94, '501', 'જગુભાઈ', 'ખીમજીભાઈ', '-', '32'),
(95, '251', 'કરશનભાઈ', 'ખોડાભાઈ', 'મિસ્ત્રી', '21'),
(96, '101', 'હર્ષદભાઈ', '-', 'મલેક', '21'),
(97, '101', 'લખુંભાઈ', 'દેવાયતભાઈ', 'ખવડ', '21'),
(98, '201 ', 'રાવતભાઈ', 'નાજાભાઈ', 'બડમલિયા', '21'),
(99, '1001 ', 'દડુભાઈ', 'ભાણભાઈ', 'ખાચર', '33'),
(100, '101', 'ભૂપત્ભાઈ', 'મેરામભાઈ', '-', '23'),
(101, '101', 'અનકભાઈ', 'લઘુભાઈ', 'ખવડ', '23'),
(102, '101', 'જોરુભાઈ', 'મેરુભાઈ', 'ખાચર', '34'),
(103, '101', 'દેવાયતભાઈ', 'વીરાભાઈ', 'ખાચર', '34'),
(104, '101', 'ભૂપત્ભાઈ', 'નાજભાઈ', 'ખાચર', '23'),
(105, '101', 'શાંતુભાઈ', 'ભીમભાઈ', 'ખાચર', '23'),
(106, '101', 'ભરતભાઈ', 'મોટભાઈ', 'ખવડ', '18'),
(107, '101', 'રતિલાલ', 'બી', 'રાઠોડ', '21'),
(108, '101', 'દડુભાઈ', 'આપભાઈ', 'ખાચર', '27'),
(109, '101', 'ધીરુભાઈ', 'આપભાઈ', 'ખાચર', '27'),
(110, '101', 'નાગભાઈ', 'વિક્રમભાઈ', 'ગોવાળીયા', '6'),
(111, '101', 'માણસીભાઈ', 'દેવાયતભાઈ', 'ખવડ', '18'),
(112, '251', 'ભરતસિહ', 'બી', 'રાઠોડ આચાર્ય સાયલા - 3', '35'),
(113, '151', 'શામજીભાઈ', 'શી', 'ઝીઝૂવાડિયા', '36'),
(114, '101', 'વનરાજભાઈ', 'કાળુંભાઈ', 'ખવડ', '21'),
(115, '101', 'તૃપ્તિબા', '-', 'ઝાલા', '37'),
(116, '101', 'જેઠુંરભાઈ', 'રાણીગભાઈ', 'ખવડ', '10 '),
(117, '101', 'ભાભલુંભાઈ', 'મેહાભાઈ', 'ખાચર', '23'),
(118, '101', 'રવુંભાઈ', 'આપભાઈ', 'ખાચર', '31'),
(119, '101', 'શિવકુભાઈ', 'જીલુભાઈ', 'ખાચર', '31'),
(120, '201', 'ચાપરાજભાઈ', 'બાબભાઈ', 'ખાચર', '37'),
(121, '101', 'જીવાભાઈ', 'દેવાયતભાઈ', 'ખાચર', '38'),
(122, '101', 'શિવરાજભાઈ', 'બહાદૂરભાઈ', 'ખાચર', '38'),
(123, '1001', 'ભવિનભાઈ', 'વીઠલભાઈ', 'હિરપરા', '33'),
(124, '1001', 'પાર્થભાઈ', 'પંકજભાઈ', 'હકાની', '33'),
(125, '1001', 'નીરવભાઈ', '-', 'જીવાણી', '33'),
(126, '1001', 'રવિભાઈ', 'ભોવાનભાઈ', 'રાંક', '33'),
(127, '2100', 'ગુજરાત', 'પેકેજિંગ ઈન્ડસ્ટ્રી', '-', '33');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `ID` int(11) NOT NULL,
  `First_Name` varchar(30) NOT NULL,
  `Last_Name` varchar(30) NOT NULL,
  `Username` varchar(30) NOT NULL,
  `Password` varchar(500) NOT NULL,
  `Last_Login` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`ID`, `First_Name`, `Last_Name`, `Username`, `Password`, `Last_Login`) VALUES
(3, 'Yuvraj', 'Khavad', 'yuvraj', '1abda3d4214514af16a5a7c1a2443c48', '22 November 2021 07:02 PM');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `location`
--
ALTER TABLE `location`
  ADD PRIMARY KEY (`ID`);

--
-- Indexes for table `persons`
--
ALTER TABLE `persons`
  ADD PRIMARY KEY (`ID`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`ID`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `location`
--
ALTER TABLE `location`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=39;

--
-- AUTO_INCREMENT for table `persons`
--
ALTER TABLE `persons`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=128;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
